{
  "cerebrumButton": "The cerebrum is the largest and most prominent part of the human brain, occupying the uppermost region. It plays a central role in a wide range of higher cognitive functions, making it a critical component of human intelligence and behavior.",
  "frontallobeButton": "The frontal lobe is a vital region of the brain located at the front of the cerebral cortex. It is associated with numerous complex functions and plays a crucial role in various aspects of human cognition and behavior",
  "temporallobeButton": "The temporal lobe is one of the four major lobes of the cerebral cortex, situated on the sides of the brain just above the ears. It has several important functions related to sensory processing, memory, language, and emotional processing.",
  "spinalcordButton": "The spinal cord is a long, thin, tubular structure that extends from the base of the brain down the vertebral column (spine) and is an essential part of the central nervous system. It serves several crucial functions in the body, primarily related to communication between the brain and the rest of the body and the coordination of various reflexes. ",
  "parietallobeButton": " The parietal lobe is one of the four major lobes of the cerebral cortex, located near the top and back of the brain, behind the frontal lobe and above the temporal lobe. It plays a critical role in processing sensory information from the body and the external environment and is involved in various cognitive functions.",
  "occipitallobeButton": "The occipital lobe is one of the four major lobes of the cerebral cortex, located at the rear (posterior) part of the brain, just above the cerebellum. It is primarily responsible for processing visual information and plays a central role in vision-related functions. ",
  "cerebellumButton": "The cerebellum is a distinct, highly convoluted structure located at the back of the brain, just above the brainstem. Despite its relatively small size compared to the cerebrum, the cerebellum plays a critical role in various aspects of motor control, coordination.",
  "cortexButton": "The term cortex typically refers to the cerebral cortex, which is the outermost layer of the brain and plays a fundamental role in various cognitive, sensory, and motor functions. It is a highly convoluted and wrinkled structure that covers the entire surface of the brain. The cerebral cortex is divided into different regions, each associated with specific functions."
}
